[
    {
        "id":1,
        "title": "עלייה חדה במקרי אלימות דרך גריינדר",
        "date": "15-12-2024",
        "content": "בעקבות העלייה במספר תקיפות וניצול דרך אפליקציית הדייטינג גריינדר, איגוד האינטרנט הישראלי יצא בקמפיין משותף עם האגודה למען הלהט\"ב להעלאת המודעות לשמירה על פרטיות וביטחון ברשת.\n\nסימני אזהרה שחשוב לשים לב אליהם:\n🚩 אין תמונה בפרופיל או שהתמונה נראית ערוכה.\n🚩 מסרב לשלוח תמונה או מספר טלפון.\n🚩 מסרב להיפגש במקום ציבורי.\n🚩 משנה את מקום המפגש ברגע האחרון למקום מבודד וחשוך.\n🚩 דמות שונה לחלוטין מהתמונה בפרופיל.\n\nטיפים לשמירה על הביטחון האישי:\n✅ הימנעו משיתוף מידע אישי כמו כתובת מגורים פרטית.\n✅ שתפו חבר קרוב על מקום וזמן המפגש.\n✅ במקרי חירום – פנו מיד למשטרה.\n\nאם נפגעתם, אל תהססו לפנות לקו הסיוע לאינטרנט בטוח של איגוד האינטרנט הישראלי - safe.org.il או לקו הקשב של האגודה למען הלהט\"ב (טלפון 2982*).\n\n*הפנייה דיסקרטית ואנונימית.\n\nלמאמר המלא: https://www.mako.co.il/pride-news/Article-ea70c501fafa391027.htm",
        "image": "/images/grinderViolence.jpg"
    },
    {
        "id": 2,
        "title": "תופעת ה-Deepnude מתפשטת במהירות - במיוחד בקרב בני נוער.",
        "date": "25-11-2024",
        "content": "תופעת ה-Deepnude, שמייצרת תמונות עירום מזויפות בטכנולוגיות מתקדמות כמו בינה מלאכותית (AI), מתפשטת במהירות – במיוחד בקרב בני נוער.\n\nמפניות שאנו מקבלים, עולה כי לאחרונה קבוצות הטלגרם הפכו לזירה מרכזית להפצת התופעה: משתמשים מעלים תמונות רגילות של נערות ונשים ומבקשים להפשיט אותן באמצעות הטכנולוגיה.\n\nתמונות מזויפות אלה לא נשארות בגבול הטכנולוגיה – הן הופכות לכלי של פגיעה, בריונות ונקמה, עם השפעות פסיכולוגיות קשות על הקורבנות.\n\nאז מה עושים?\n✔ דברו עם הילדים – שוחחו בפתיחות על התופעה, שאלו אם נתקלו בה וכיצד הרגישו.\n✔ הבהירו את ההשלכות – הסבירו שמדובר בפגיעה אמיתית ובעבירה פלילית, גם אם נעשית \"בהומור\".\n✔ אל תישארו אדישים – אם נחשפים לתוכן כזה, אל תשתפו או תפיצו, מחקו ודווחו.\n\nאם אתם או ילדיכם נפגעתם, או זקוקים לעזרה – פנו לקו הסיוע שלנו לאינטרנט בטוח.\n\nלפרטים נוספים: https://www.isoc.org.il/netica/online-safety-guides/guides-parents/deep-nude",
        "image": "/images/deepNude.jpg"
    },
   
    {
        "id": 3,
        "title": "הודעות מזויפות הקוראות להיכנס למרחב מוגן",
        "date": "23-09-2024",
        "content": "בימים רגישים אלו, כשהודעות פייק מציפות את הסמארטפונים של כולנו – כולל הודעות מזויפות הקוראות להיכנס למרחב מוגן – חשוב לדעת להבחין בין אמת לפייק.\n\nקו הסיוע לאינטרנט בטוח של איגוד האינטרנט הישראלי קיבל פניות רבות מאזרחים מודאגים, ומציע כמה טיפים חשובים.\n\nקיבלת הודעה חשודה הקוראת להיכנס למחב המוגן? \nכך נבדיל בין הודעה אמיתית להודעת פייק\n1. הטילו ספק בהודעות המיעות בסמס או וואטסאפ ללא חתימה ברורה של רשויות המדינה או כוחות הביטחון והצליבו עם מקורות אחרים.\n2. היכנסו באופן אקטיבי לאתרים או אפליקציות של פיקוד העורף, דובר צה\"ל והמשטרה, לוודא אם אכן פורסמה הנחיה רשמית.\n3. אם מתקבלת הודעה חשודה ויש ספק, רצוי לבצע בדיקה גם באתרי החדשות המובילים.\n4. התרעות של רשויות וגופי ביטחון לרוב ישתמשו בלינקים עם סימות il. ישראלית.\n5. אין ללחוץ על לינקים או להעביר את ההודעה הלאה. במידה ולחתם מומלץ להחליף סיסמאות ולהתקין אימות דו שלבי.\n6. כדאי לדווח ולהתייעץ במקרים כאלה עם קו הסיוע אינטרנט בטוח בכתובת: www.safe.org.il\n\nבמקרה של ספק, פנו לקו הסיוע לאינטרנט בטוח: www.safe.org.il\n\nשמרו על עצמכם ועל הסובבים!",
        "image": "/images/fakeMerhavMugan.jpg"
    },

    {
        "id": 4,
        "title": "אזהרת פישינג בוואטסאפ!",
        "date": "08-08-2024",
        "content": "קו הסיוע לאינטרנט בטוח קיבל עשרות פניות בחודשים האחרונים בנוגע לקמפיין פישינג רחב היקף בוואטסאפ, שמטרתו לגנוב את פרטי הכניסה של המשתמשים לפייסבוק.\n\nמה אנחנו יודעים על הקמפיין?\n\n• הודעות מאיימות: ההודעות מאיימות בחסימת חשבון הפייסבוק תוך מספר שעות/ימים אלא אם המשתמש ינקוט פעולה.\n• קישור זדוני: ההודעות כוללות קישור זדוני שמטרתו לגנוב את פרטי הכניסה לפייסבוק של המשתמש.\n• קידומת בינלאומית: לעתים קרובות, ההודעה נשלחת ממספר טלפון עם קידומת בינלאומית (למשל +84).\n• ניסוח דומה להודעות פישינג קלאסיות: ההודעה כוללת ניסוח שמזכיר מאוד הודעות פישינג קלאסיות, כמו איומים בחסימת חשבון, דרישה לפעולה מיידית וקישור זדוני שאינו מוכר כאחת מכתובות האתר הרשמיות של פייסבוק.\n\nמה לעשות אם קיבלתם הודעה כזו?\n\n• אל תלחצו על הקישור! הקישור יוביל אתכם לאתר מזויף שיגנוב את פרטי הכניסה שלכם לפייסבוק.\n• דווחו על ההודעה כפישינג: דווחו על ההודעה לוואטסאפ.\n• שתפו את האזהרה: שתפו את האזהרה עם חברים ובני משפחה כדי לעזור להם להימנע מליפול קורבן לקמפיין הפישינג.\n\nזכרו: פייסבוק לעולם לא יאיימו לחסום את החשבון שלכם בהודעה פרטית בוואטסאפ. אם קיבלתם הודעה כזו, מדובר בניסיון פישינג.\n\nלמידע נוסף, ולדיווח על תכני פישינג, היכנסו לאתר קו הסיוע לאינטרנט בטוח - safe.org.il",
        "image": "/images/whatsappPhishing.jpg"
    }
]