"use client";

import React, { useState } from "react";
import styles from "./page.module.css";
import { useRouter } from "next/navigation";

export default function HomePage() {
  const router = useRouter(); // Initialize the router
  // const [content, setContent] = useState<number>(0); // Manage which content to display

  // const renderContent = (): JSX.Element => {
  //   if (content === 0) return <Intro setContent={setContent} />;
  //   return <WizardStart router={router} />;
  // };

//   return <div>{renderContent()}</div>;
// }

// interface IntroProps {
//   setContent: React.Dispatch<React.SetStateAction<number>>;
// }

// const Intro: React.FC<IntroProps> = ({ setContent }) => {
//   const handleStartClick = (): void => {
//     setContent(1); // Switch to WizardStart component
//   };

  const handleHelpClick=(): void=>{
    router.push("/wizard");
  };
  const handleNewsClick=(): void=>{
    router.push("/newsDynamic");

  };
   const handleReportClick=(): void=>{
    router.push("/report");


  };
  return (
    <div className={styles.container}>
      {/* Image/Graphic Section */}
      <div className={styles.graphicArea}>
        <svg width="108" height="115" viewBox="0 0 108 115" fill="none" xmlns="http://www.w3.org/2000/svg">
          <g clipPath="url(#clip0_1070_3044)">
            <path d="M62.3704 115C59.2019 115 56.0672 114.525 53.0851 113.541C43.5796 110.437 36.6666 103.11 29.9737 96.0199C24.6195 90.3377 19.5533 84.9779 13.5721 82.0774C12.996 81.7891 12.403 81.5346 11.793 81.2633C8.70923 79.8724 4.86298 78.1593 2.32141 74.2751C-1.11819 69.0509 -0.677651 61.2146 3.33804 56.0583C6.99791 51.3599 13.013 49.1209 19.028 50.2065C23.8062 51.0715 28.4488 54.0398 32.1256 58.5346L24.2467 64.9631C22.1118 62.3341 19.6041 60.6549 17.215 60.2139C14.9615 59.8068 12.6571 60.6209 11.3525 62.3001C10.0139 64.0302 9.75975 67.0664 10.8103 68.6777C11.7252 70.0855 13.6907 70.9506 15.9442 71.9683C16.6389 72.2736 17.3336 72.5959 18.0114 72.9181C25.67 76.6497 31.6173 82.9425 37.3613 89.0317C43.4441 95.4771 49.1881 101.566 56.2367 103.873C62.9973 106.078 71.0117 104.416 77.6706 99.4292C83.9737 94.7139 89.0908 87.2677 92.4796 77.8879C95.3261 70.0516 97.0036 60.7057 97.6474 49.3584C98.0202 42.5229 98.088 34.6018 95.5803 27.7493L105.12 24.2552C108.254 32.8378 108.237 42.0649 107.797 49.9351C107.102 62.3001 105.221 72.5789 102.036 81.365C97.9694 92.6106 91.6493 101.668 83.7535 107.588C77.264 112.456 69.707 115 62.3704 115Z"
              fill="#FE5068" />
            <path d="M44.8333 64.132C42.529 46.3732 32.1255 30.056 16.9946 20.4897L22.4167 11.8901C40.0721 23.0509 52.2209 42.0988 54.9149 62.826L44.8333 64.132Z"
              fill="#FE5068" />
            <path d="M60.2523 57.5339C56.5246 38.6047 47.6461 21.0833 34.5654 6.90339L42.0377 0C56.3891 15.5708 66.1318 34.7883 70.2153 55.5664L60.2353 57.5339H60.2523Z"
              fill="#FE5068" />
            <path d="M76.0438 53.1069C75.0611 38.2485 70.9098 23.424 64.0137 10.2448L73.0278 5.5295C80.5678 19.9639 85.1257 36.1792 86.1932 52.4285L76.0438 53.1069Z"
              fill="#FE5068" />
          </g>
          <defs>
            <clipPath id="clip0_1070_3044">
              <rect width="108" height="115" fill="white" />
            </clipPath>
          </defs>
        </svg>
      </div>

      {/* Text Section */}
      <div style={{ height: "70px" }} />
      <div className={styles.title}>
        היי, אני לינק
      </div>
      <div style={{ height: "48px" }} />
      <div className={styles.textArea}>
      אני כאן לעזור לך בכל מה שקשור לפגיעות ברשת
      </div>
      <div style={{ height: "86px" }} />
      <div className={`${styles.textArea} ${styles.starting}`}>
        איך תרצה  שנתחיל?
      </div>
      {/* <div className={styles.textArea}>
        תחשוב לי להגיד שאני לא אדם אמיתי, אז אין מה לחשוש מביקורת. יש לי כמה
        שאלות קצרות, ואחרי זה אדאג לחבר אותך למידע הנכון ולאנשים הנכונים שיעזרו
        לך.
      </div> */}

      <div style={{ height: "22px" }} />
      <div className={styles.buttonArea}>
        <button className={`${styles.buttonStyle} ${styles.helpButton}`} onClick={handleHelpClick}>
          עזרה ראשונה
          <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M2.51604 17.4193C-1.48165 14.1935 -0.0517076 7.11826 2.23928 4.51611L5.80645 7.2473C4.68402 8.52328 3.8768 12.8315 5.53738 14.172L2.51604 17.4193Z" fill="white"/>
            <path d="M13.0737 5.80645C12.5274 4.95653 11.2963 4.3923 9.78126 4.29945C8.35358 4.21374 7.2901 4.58514 6.6054 5.40649L3.22559 2.69246C4.81352 0.792635 7.23911 -0.157276 10.0581 0.0212785C13.0154 0.199833 15.4628 1.47828 16.774 3.52095L13.0737 5.80645Z" fill="white"/>
            <path d="M16.755 17.4119L14.1934 13.9273C15.052 13.2653 15.6267 12.2177 15.7261 11.1265C15.8325 10.0353 15.4706 8.88584 14.7539 8.06378L17.9329 5.16113C19.4231 6.87799 20.1824 9.26413 19.9624 11.5557C19.7424 13.84 18.5432 16.0297 16.755 17.4192V17.4119Z" fill="white"/>
            <path d="M9.50343 20.0002C7.3913 20.0002 5.65012 19.4706 3.87109 18.2986L6.49043 14.8389C7.55785 15.5449 8.38302 15.792 9.64726 15.7638C10.8964 15.7426 12.1833 15.4178 13.0085 14.9165L15.484 18.468C13.9396 19.4 11.8427 19.9578 9.73054 20.0002C9.65483 20.0002 9.57913 20.0002 9.50343 20.0002Z" fill="white"/>
          </svg>
        </button>
        <button className={`${styles.buttonStyle} ${styles.newsButton}`} onClick={handleNewsClick}>
          עדכונים          
          <svg width="19" height="19" viewBox="0 0 19 19" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M18.5 12.311H17.5067C17.6271 10.5142 17.5268 8.71749 17.1856 6.94972L13.2425 7.65489C13.5435 9.19083 13.6137 10.7461 13.4933 12.3013H5.64716C5.55686 11.1518 5.50669 10.0506 5.60702 8.97831C5.73746 7.58727 6.1087 6.43774 6.73077 5.56834C7.36288 4.66996 8.28595 4.06138 9.199 3.94547L8.66722 0.120117C6.60033 0.380936 4.68395 1.57877 3.39967 3.40451C2.39632 4.82452 1.79431 6.5923 1.60368 8.64021C1.48328 9.88635 1.53344 11.1132 1.61371 12.311H0.5V16.175H6.8913C6.97157 16.687 7.07191 17.2086 7.38294 17.6723C7.88461 18.3968 8.65719 18.8315 9.51003 18.8798C9.5602 18.8798 9.60033 18.8798 9.6505 18.8798C10.5936 18.8798 11.4866 18.3871 11.9983 17.5564C12.3294 17.0347 12.4298 16.5227 12.5 16.175H18.5V12.311Z" fill="white"/>
            <path d="M13.8044 5.1431C15.2118 5.1431 16.3528 4.04458 16.3528 2.68947C16.3528 1.33437 15.2118 0.23584 13.8044 0.23584C12.3969 0.23584 11.2559 1.33437 11.2559 2.68947C11.2559 4.04458 12.3969 5.1431 13.8044 5.1431Z" fill="white"/>
          </svg>

        </button>
        <button className={`${styles.buttonStyle} ${styles.reportButton}`} onClick={handleReportClick}>
          דיווח   
          <svg width="16" height="19" viewBox="0 0 16 19" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M15.4843 11.3787V2.84924H15.4686L15.5 0.969593C14.1878 0.922207 13.2292 1.53823 12.5299 1.9726C12.3491 2.08317 12.1684 2.20163 11.9798 2.2964C11.4534 2.56492 10.8955 2.636 10.534 2.48595C10.2748 2.37538 9.96831 2.10686 9.64615 1.82254C9.38685 1.59351 9.13541 1.37237 8.8604 1.16703C6.99031 -0.215059 4.39733 -0.365115 2.34652 0.693174L0.5 0.708969L0.68858 19L3.83159 18.9684L3.67444 3.55213C4.67234 2.9756 6.07884 3.03089 7.01388 3.71009C7.21032 3.85225 7.39104 4.0181 7.57177 4.18395C8.04322 4.60253 8.58538 5.08429 9.32399 5.39229C9.84259 5.60553 10.4005 5.7161 10.9819 5.7161C11.4298 5.7161 11.8855 5.64502 12.3413 5.51866V9.73602C11.1862 9.83079 10.0312 9.87028 9.45757 9.58596C9.25327 9.48329 9.06469 9.35693 8.87611 9.23847C8.6561 9.09631 8.42823 8.95415 8.20037 8.82779C7.09246 8.21967 5.92954 8.1091 4.94735 8.14069V11.2998C5.55238 11.2998 6.21241 11.3314 6.69172 11.5999C6.85673 11.6946 7.02174 11.7973 7.18675 11.9C7.44605 12.0658 7.72892 12.2475 8.05893 12.4133C8.90754 12.8398 9.90545 12.9662 10.9505 12.9662C11.7362 12.9662 12.5534 12.8951 13.3549 12.824C14.0778 12.7608 14.8243 12.6976 15.4921 12.6898L15.4764 11.3787H15.4843Z" fill="white"/>
          </svg>

        </button>

      </div>
    </div>
  );
};

// interface WizardStartProps {
//   router: ReturnType<typeof useRouter>;
// }

// const WizardStart: React.FC<WizardStartProps> = ({ router }) => {
//   const handleWizardStartClick = (id: number): void => {
//     if (id === 0) router.push("/wizard");
//   };

//   const questions = [
//     "שלחו לי הודעה מטרידה",
//     "אני חושב שסוחטים אותי",
//     "גנבו לי כסף באשראי",
//     "מאיימים עליי",
//     "פרצו לי לחשבון",
//     "ראיתי חשבון שתומך בטרור",
//   ];

//   return (
//     <div className={styles.container}>
//       <div className={styles.container}>
//         <div className={styles.graphicArea}>
//           <svg
//             width="115"
//             height="117"
//             viewBox="0 0 115 117"
//             fill="none"
//             xmlns="http://www.w3.org/2000/svg"
//           >
//             <g clipPath="url(#clip0_1125_96)">
//               <path
//                 d="M9.73001 23.61L0.960007 23.1L2.22001 1.55L7.14001 2.49C13.53 3.71 20.04 3.9 26.48 3.07L27.62 11.78C21.9 12.53 16.14 12.56 10.42 11.88L9.73001 23.6V23.61Z"
//                 fill="#FE5068"
//               />
//               <path
//                 d="M112.57 21.15L103.78 20.87L104.16 9.06L92.68 9.41V9.49L90.72 9.46L90.65 0.67L113.25 0L112.57 21.15Z"
//                 fill="#FE5068"
//               />
//               <path
//                 d="M1.13 116.09L1.93 91.88L10.71 92.16L10.22 107.27L23.31 107.22L23.41 116.01L1.13 116.09Z"
//                 fill="#FE5068"
//               />
//               <path
//                 d="M115 113.68L89.28 110.49L90.36 101.77L105.5 103.64L104.73 92.35L113.5 91.75L115 113.68Z"
//                 fill="#FE5068"
//               />
//               <path
//                 d="M33.54 63.83C22.34 63.83 11.15 63.61 0 63.18L0.34 54.4C36.32 55.81 72.73 54.91 108.58 51.76L109.35 60.51C84.24 62.72 58.86 63.83 33.54 63.83Z"
//                 fill="#FE5068"
//               />
//               <path
//                 d="M26.78 51.14L19.63 46.03C26.98 35.75 38.32 28.55 50.75 26.27C63.17 23.99 76.34 26.69 86.86 33.68C91.63 36.85 94.93 40.31 96.97 44.27L89.15 48.29C87.82 45.7 85.47 43.31 81.99 41C73.35 35.26 62.54 33.04 52.33 34.91C42.12 36.79 32.81 42.7 26.78 51.14Z"
//                 fill="#FE5068"
//               />
//               <path
//                 d="M52.06 49.61L43.73 46.8C45.95 40.21 52.35 35.3 59.29 34.86C66.23 34.43 73.2 38.49 76.23 44.76L68.32 48.59C66.83 45.5 63.27 43.43 59.84 43.64C56.42 43.85 53.15 46.37 52.05 49.62L52.06 49.61Z"
//                 fill="#FE5068"
//               />
//               <path
//                 d="M55.7 84.56C53.37 84.56 51.04 84.33 48.75 83.86C36.89 81.4 26.56 72.45 22.44 61.06L30.7 58.07C33.81 66.65 41.6 73.4 50.53 75.26C59.48 77.12 69.29 74.02 75.56 67.38L81.95 73.41C75.24 80.52 65.45 84.57 55.69 84.57L55.7 84.56Z"
//                 fill="#FE5068"
//               />
//             </g>
//             <defs>
//               <clipPath id="clip0_1125_96">
//                 <rect width="115" height="116.09" fill="white" />
//               </clipPath>
//             </defs>
//           </svg>
//         </div>

//         <div style={{ height: "50px" }} />

//         <div className={styles.title}>תספר לי מה קרה </div>

//         <div style={{ height: "25px" }} />
//         <div className={styles.buttonArea}>
//           {questions.map((question, index) => (
//             <button
//               key={index}
//               className={styles.multipleChoiceButton}
//               onClick={() => handleWizardStartClick(index)}
//             >
//               {question}
//             </button>
//           ))}
//         </div>
//       </div>
//     </div>
//   );
// };
